Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71J21.atdf
      <value-group caption="" name="SUPC_WUIR__WKUPEN5">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN6">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN7">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN8">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN9">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN10">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN11">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN12">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN13">
        <value caption="The corresponding wakeup input has no wakeup effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wakeup input is enabled for a wakeup of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT0">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT1">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT2">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT3">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT4">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT5">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT6">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT7">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT8">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT9">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT10">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply." name="HIGH" value="1"/>
      </value-group>
